판다스(Pandas)

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.22.4 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
pip list

Package            Version
------------------ -----------
asttokens          2.4.1
colorama           0.4.6
comm               0.2.2
debugpy            1.8.1
decorator          5.1.1
exceptiongroup     1.2.0
executing          2.0.1
importlib_metadata 7.1.0
ipykernel          6.29.4
ipython            8.18.1
jedi               0.19.1
jupyter_client     8.6.1
jupyter_core       5.7.2
matplotlib-inline  0.1.6
nest-asyncio       1.6.0
numpy              1.26.4
packaging          24.0
pandas             2.2.2
parso              0.8.4
pip                22.0.4
platformdirs       4.2.0
prompt-toolkit     3.0.43
psutil             5.9.8
pure-eval          0.2.2
Pygments           2.17.2
python-dateutil    2.9.0.post0
pytz               2024.1
pywin32            306
pyzmq              25.1.2
setuptools         58.1.0
six                1.16.0
stack-data         0.6.3
tornado            6.4
traitlets          5.14.2
typing_extensions  4.11.0
tzdata             2024.1
wcwidth            0.2.13
zipp               3.18.1
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 22.0.4; however, version 24.0 is available.
You should consider upgrading via the 'c:\RPA_smc\Practice_Python\myvenv\Scripts\python.exe -m pip install --upgrade pip' command.

In [5]:
#시리즈(Series)
 
import pandas as pd

# 리스트를 데이터를 이용하여 시리즈 생성

data = [1, 2, 3, 4, 5]
sr = pd.Series(data)
sr

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [10]:
sr = pd.Series([17000, 18000, 1000, 5000],
               index=["피자", "치킨", "콜라", "맥주"])
print('시리즈 출력 :')
print('-'*15)
print(sr)

시리즈 출력 :
---------------
피자    17000
치킨    18000
콜라     1000
맥주     5000
dtype: int64

In [11]:
print('시리즈의 값 : {}'.format(sr.values))
print('시리즈의 인덱스 : {}'.format(sr.index))

시리즈의 값 : [17000 18000  1000  5000]
시리즈의 인덱스 : Index(['피자', '치킨', '콜라', '맥주'], dtype='object')

주어진 데이터를 사용하여 시리즈를 생성하고, 특정 조건에 맞는 데이터를 선택해 보세요


data = [10, 20, 30, 40, 50]

index = ['가', '나', '다', '라', '마']

1. '다' 인덱스의 데이터를 출력하세요
2. 데이터 값이 30보다 큰 항목만 출력하세요.

데이터 프레임

In [9]:
data = {
    '이름': ['김지수', '박영희', '이민준', '최예원'],
    '나이': [28, 22, 21, 30],
    '도시': ['서울', '부산', '대구', '광주']
}

df = pd.DataFrame(data)
df

    이름  나이  도시
0  김지수  28  서울
1  박영희  22  부산
2  이민준  21  대구
3  최예원  30  광주

In [12]:
df.head(2)

    이름  나이  도시
0  김지수  28  서울
1  박영희  22  부산

In [13]:
df.tail(2)

    이름  나이  도시
2  이민준  21  대구
3  최예원  30  광주

In [14]:
df['이름']

0    김지수
1    박영희
2    이민준
3    최예원
Name: 이름, dtype: object

In [15]:
df.iloc[0:2, 0:2]

    이름  나이
0  김지수  28
1  박영희  22

In [18]:
df.index = ['A', 'B', 'C', 'D']

df

    이름  나이  도시
A  김지수  28  서울
B  박영희  22  부산
C  이민준  21  대구
D  최예원  30  광주

In [23]:
df.loc['A' : 'C', ['이름', '나이']]

df

    이름  나이  도시
A  김지수  28  서울
B  박영희  22  부산
C  이민준  21  대구
D  최예원  30  광주

In [22]:
df[df['나이'] >= 25]

    이름  나이  도시
A  김지수  28  서울
D  최예원  30  광주

In [24]:
data = {
    '이름': ['김지수', '박영희', '이민준', '최예원'],
    '나이': [28, 22, 21, 30],
    '도시': ['서울', '부산', '대구', '광주']
}

df = pd.DataFrame(data)

# 나이가 25세 이상인 이름, 나이 컬럼만 선택해 보기.

In [27]:
df[df['나이'] >= 25][['이름', '나이']]

df.loc[df['나이'] >= 25][['이름', '나이']]

    이름  나이
0  김지수  28
3  최예원  30

In [ ]:
(df['도시'] == '서울')

In [28]:
df.rename(columns=['이름' : '성명', '도시' : '거주지'], )

SyntaxError: invalid syntax (3037220918.py, line 1)

In [30]:
df_index = df.set_index('성명', drop=False)
df_index

KeyError: "None of ['성명'] are in the columns"

In [32]:
df['직업'] = ['의사', '변호사', '회계사', '엔지니어']
df

    이름  나이  도시    직업
0  김지수  28  서울    의사
1  박영희  22  부산   변호사
2  이민준  21  대구   회계사
3  최예원  30  광주  엔지니어